**FREE
Ctl-Opt DFTACTGRP(*NO);

Dcl-DS SYSDUMMY1_T  QUALIFIED TEMPLATE EXTNAME('SYSIBM/SYSDUMMY1');
End-DS;

Dcl-DS myResultSet  QUALIFIED;
   IBMrequired               LIKE(SYSDUMMY1_T.IBMREQD);
End-DS;

EXEC SQL   DECLARE C1 CURSOR FOR
                  SELECT IBMREQD
                    FROM SYSIBM/SYSDUMMY1;

EXEC SQL   OPEN  C1;

EXEC SQL   FETCH C1 INTO :myResultSet;

EXEC SQL   CLOSE C1;

*INLR = *ON;
